W6/D3/first_route/app/controllers/users_controller.rb

    def create
        user = User.new(
            params.require(:users).permit(:name, :email)
        )
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Gini"], ["email", "gini@gmail.com"], ["created_at", "2021-10-06 23:37:36.532422"], ["updated_at", "2021-10-06 23:37:36.532422"]]

    def update
        user = User.find_by(id: params[:id])

        if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "clifford"], ["email", "clifford_big_dog_new@gmail.com"], ["updated_at", "2021-10-07 07:26:18.970845"], ["id", 1]]