W7/D5/RedditClone/app/controllers/subs_controller.rb

  def update
    @sub = Sub.find(params[:id])
    if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["title", "Subscribed"], ["updated_at", "2021-10-15 23:51:07.529473"], ["id", 1]]