W7/D5/RedditClone/app/models/user.rb

INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def password=(password)
    self.password_digest = BCrypt::Password.create(password)